In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages (2.0.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\swakshwar ghosh\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

WARNING: Ignoring invalid distribution -rotobuf (c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -rotobuf (c:\users\swakshwar ghosh\appdata\local\programs\python\python310\lib\site-packages)

[notice] A new release of pip is available: 23.0.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd

In [2]:
sample_data = pd.read_csv(r'random_data.csv')

The sample data that we created by using read_csv method is a instance of DataFrame Class, now dataframe has some inbuilt methods like head, tail, sample and some properties like columns, shape

### Data Frame Methods and Properties

- head
- tail
- sample

#### Properties

- columns
- shape

In [3]:
sample_data.head()

          name  age  class
0        madhu   21    mca
1     saikiran   21    mca
2  navvyareddy   21  btech
3       balaji   21  btech
4    jagadhees   21    mca

In [4]:
sample_data.head(1)

    name  age class
0  madhu   21   mca

In [5]:
sample_data.head(-1)

          name  age  class
0        madhu   21    mca
1     saikiran   21    mca
2  navvyareddy   21  btech
3       balaji   21  btech
4    jagadhees   21    mca
5     sireesha   21  btech

In [8]:
sample_data.tail()

          name  age  class
2  navvyareddy   21  btech
3       balaji   21  btech
4    jagadhees   21    mca
5     sireesha   21  btech
6        shaik   21  btech

In [10]:
sample_data.tail(3)

        name  age  class
4  jagadhees   21    mca
5   sireesha   21  btech
6      shaik   21  btech

In [12]:
sample_data.sample(5)

          name  age  class
6        shaik   21  btech
5     sireesha   21  btech
3       balaji   21  btech
1     saikiran   21    mca
2  navvyareddy   21  btech

In [13]:
sample_data.shape

(7, 3)

In [14]:
sample_data.columns

Index(['name', 'age', 'class'], dtype='object')

In [15]:
sample_dict = {
    'name' : ['madhu', 'balaji'],
    'age' : [21, 21],
    'class' : ['btech', 'btech']
}

sample_data_2 = pd.DataFrame(data = sample_dict)

In [16]:
sample_data_2.head()

     name  age  class
0   madhu   21  btech
1  balaji   21  btech

### Types of Data

- Structured Data - SQL Table
- Unstructured Data - Images, Videos
- Semi-Structured Data - XML, YML, YAML

### In terms of data type

- Numerical Data
- Categorical Data

In [6]:
sample_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   class   7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [9]:
sample_data.describe()

             age
count   7.000000
mean   21.714286
std     1.976047
min    19.000000
25%    20.500000
50%    22.000000
75%    22.500000
max    25.000000

In [10]:
sample_data['class'].unique()

array(['mca', 'btech'], dtype=object)

In [11]:
sample_data['name'].unique()

array(['madhu', 'saikiran', 'navvyareddy', 'balaji', 'jagadhees',
       'sireesha', 'shaik'], dtype=object)

In [4]:
sample_data['class'].mode()

0    btech
Name: class, dtype: object

In [5]:
adata = {
    'x1' : ['a', 'b', 'c'],
    'x2' : [1 , 2, 3]
}

bdata = {
    'x1' : ['a', 'b', 'd'],
    'x3' : ['apple', 'banana', 'coriander']
}

adf = pd.DataFrame(data = adata)
bdf = pd.DataFrame(data = bdata)

In [6]:
pd.merge(adf, bdf, how='left', on='x1')

  x1  x2      x3
0  a   1   apple
1  b   2  banana
2  c   3     NaN